# GetScans Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudInstance..::..GetScans Method
PointCloudInstance Class See Also
---
Returns array of scan names.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<string> GetScans()
```

Visual Basic
---
```text
Public Function GetScans As IList(Of String)
```

Visual C++
---
```text
public:
IList<String^>^ GetScans()
```

# ### Return Value
Resulting array of scan names.
# See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace